Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_ZShapeProfile Properties
The IFC2X3_ParametricObject_ZShapeProfile type exposes the following members.
Properties
Name | Description
Depth
 The depth.
Description
 The description of the product.
 (Inherited from ReferenceModelObjectAttribute.)
EdgeRadius
 The edge radius.
Extrusion
 The extrusion vector.
 (Inherited from ReferenceModelObjectAttribute.)
FilletRadius
 The fillet radius.
FlangeThickness
 The flange thickness.
FlangeWidth
 The flange width.
Name
 The name of the product.
 (Inherited from ReferenceModelObjectAttribute.)
ObjectType
 The object type of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Origin
 The origin of the extrusion.
 (Inherited from ReferenceModelObjectAttribute.)
ProfileName
 The name of the profile (often empty).
 (Inherited from ReferenceModelObjectAttribute.)
WebThickness
 The web thickness.
xDir
 The X-axis direction.
 (Inherited from ReferenceModelObjectAttribute.)
Top
See Also
Reference
IFC2X3_ParametricObject_ZShapeProfile Class
Tekla.Structures.Model.Collaboration Namespace